# Ultralytics YOLO 🚀, AGPL-3.0 license
# TDDet: Lightweight and efficient tea disease detector
# Architecture: Backbone (MobileNetV4ConvLarge with Uib+MQA) -> Neck (DySample+CFF) -> Head (Detect)
# Based on Figure 3: Overall structure of the TDDet network model

# Parameters
nc: 6  # number of classes (tea diseases)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# Backbone: MobileNetV4ConvLarge với Uib blocks
# MobileNetV4ConvLarge returns features at scales [4, 8, 16, 32] = [P2, P3, P4, P5]
# Structure từ hình ảnh:
# Stage_1: Conv2d(320x320x64) - Initial conv
# Stage_2: Uib(160x160x128) - P2/4
# Stage_3: Uib(80x80x256) - P3/8 - Output to Neck
# Stage_4: Uib+MQA(40x40x512) - P4/16 - Output to Neck
# Stage_5: Uib+MQA(20x20x512) - P5/32 - Output to Neck
# SPPF: (20x20x512) - Final backbone output
backbone:
  # [from, repeats, module, args]
  - [-1, 1, MobileNetV4ConvLarge, []]  # 0: Returns list of 4 feature maps [P2, P3, P4, P5]
  - [-1, 1, SPPF, [512, 5]]  # 1: SPPF on P5 (20x20x512) - Final backbone output

# Neck: Feature fusion với DySample và CFF
# Structure từ hình ảnh:
# Top path: SPPF → CFF → Head (P5)
# Middle path: Stage_5 → DySample → CFF → Conv → Concat với bottom path → Head (P4)
# Bottom path: Stage_4 → DySample → CFF → Conv → Concat với Stage_3 → Head (P3)
# Note: MobileNetV4ConvLarge returns features list [P2, P3, P4, P5] at layer 0
#       Layer indices: 0=MobileNetV4ConvLarge, 1=SPPF, 2+=head layers
head:
  # Top path: SPPF → CFF → Head (P5)
  - [-1, 1, CFF, [512]]  # 2: CFF on SPPF output (P5 scale, 20x20x512)
  
  # Middle path: Stage_5 (P5) → DySample → CFF → Conv → Concat → Head (P4)
  # Reference P5 from MobileNetV4ConvLarge (features[3], layer 0)
  - [0, 1, DySample, [2, 'lp']]  # 3: DySample on P5 (upsample 2x to match P4 scale)
  - [[-1, 0], 1, Concat, [1]]  # 4: Concat với P4 from MobileNetV4ConvLarge (features[2], layer 0)
  - [-1, 3, CFF, [512]]  # 5: CFF on concatenated features (P4 scale, 40x40x512)
  - [-1, 1, Conv, [512, 3, 2]]  # 6: Conv for downsampling
  
  # Bottom path: Stage_4 (P4) → DySample → CFF → Conv → Concat với Stage_3 → Head (P3)
  # Reference P4 from MobileNetV4ConvLarge (features[2], layer 0)
  - [0, 1, DySample, [2, 'lp']]  # 7: DySample on P4 (upsample 2x to match P3 scale)
  - [[-1, 0], 1, Concat, [1]]  # 8: Concat với P3 from MobileNetV4ConvLarge (features[1], layer 0)
  - [-1, 3, CFF, [256]]  # 9: CFF on concatenated features (P3 scale, 80x80x256)
  - [-1, 1, Conv, [256, 3, 2]]  # 10: Conv for downsampling
  
  # Concat middle và bottom paths
  - [[-1, 6], 1, Concat, [1]]  # 11: Concat bottom path (layer 10) với middle path (layer 6)
  - [-1, 3, CFF, [512]]  # 12: CFF on concatenated (P4 scale, 40x40x512)
  
  # Prepare outputs for Head
  # P3: from layer 9 (80x80x256)
  # P4: from layer 12 (40x40x512)
  # P5: from layer 2 (20x20x512)
  - [9, 1, Conv, [256, 1]]  # 13: Conv for P3 output
  - [12, 1, Conv, [512, 1]]  # 14: Conv for P4 output
  - [2, 1, Conv, [512, 1]]  # 15: Conv for P5 output
  
  # Detect head với 3 scales: P3, P4, P5
  - [[13, 14, 15], 1, Detect, [nc]]  # Detect(P3, P4, P5)

