# Improved YOLOv8s Architecture Configuration
# Based on paper: sensors-24-02896

# Parameters
nc: 6  # number of classes (Tea diseases)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n
  s: [0.33, 0.50, 1024]  # YOLOv8s
  m: [0.67, 0.75, 768]   # YOLOv8m
  l: [1.00, 1.00, 512]   # YOLOv8l
  x: [1.00, 1.25, 512]   # YOLOv8x

# Backbone: RFCBAMConv + C2f_RFCBAM + Mix-SPPF
backbone:
  # [from, repeats, module, args]
  - [-1, 1, RFCBAMConv, [64, 3, 2]]      # 0: P1/2 - 2x downsampling
  - [-1, 1, RFCBAMConv, [128, 3, 2]]     # 1: P2/4 - 4x downsampling
  - [-1, 1, C2f_RFCBAM, [128, 1]]        # 2: P2/4
  - [-1, 1, RFCBAMConv, [256, 3, 2]]     # 3: P3/8 - 8x downsampling
  - [-1, 1, C2f_RFCBAM, [256, 2]]        # 4: P3/8
  - [-1, 1, RFCBAMConv, [512, 3, 2]]     # 5: P4/16 - 16x downsampling
  - [-1, 1, C2f_RFCBAM, [512, 2]]        # 6: P4/16
  - [-1, 1, MixSPPF, [512, 512, 5]]      # 7: P5/32 - 32x downsampling

# Neck: RepGFPN + AKConv + C2f
head:
  # [from, repeats, module, args]
  # Top-down path
  - [-1, 1, C2f, [256]]                   # 8: P3 processing
  - [-1, 1, RepGFPN, [256, 1]]            # 9: RepGFPN for P3
  - [-1, 1, AKConv, [256, 256, 5]]       # 10: AKConv for P3
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11: Upsample P3
  - [[-1, 6], 1, Concat, [1]]             # 12: Concat with P4
  - [-1, 1, C2f, [512]]                   # 13: P4 processing
  - [-1, 1, RepGFPN, [512, 1]]            # 14: RepGFPN for P4
  - [-1, 1, AKConv, [512, 512, 5]]        # 15: AKConv for P4
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16: Upsample P4
  - [[-1, 4], 1, Concat, [1]]             # 17: Concat with P5
  - [-1, 1, C2f, [1024]]                  # 18: P5 processing
  - [-1, 1, RepGFPN, [1024, 1]]           # 19: RepGFPN for P5
  
  # Bottom-up path
  - [-1, 1, Conv, [512, 3, 2]]            # 20: Downsample
  - [[-1, 15], 1, Concat, [1]]            # 21: Concat with P4
  - [-1, 1, C2f, [512]]                   # 22: P4 processing
  
  - [-1, 1, Conv, [256, 3, 2]]            # 23: Downsample
  - [[-1, 10], 1, Concat, [1]]            # 24: Concat with P3
  - [-1, 1, C2f, [256]]                   # 25: P3 processing
  
  # Dynamic Head outputs
  - [[10, 22, 19], 1, DynamicHead, [256, nc]]  # 26: Dynamic Head (P3, P4, P5)

