# Ultralytics YOLO 🚀, AGPL-3.0 license
# Improved YOLOv8 with RFCBAM, MixSPPF, RepGFPN, and Dynamic Head
# Architecture: Backbone (RFCBAMConv + C2f_RFCBAM + MixSPPF) -> Neck (RepGFPN + AKConv) -> Head (Dynamic Head)

# Parameters
nc: 6  # number of classes (will be overridden by data.yaml if specified)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n
  s: [0.33, 0.50, 1024]  # YOLOv8s
  m: [0.67, 0.75, 768]   # YOLOv8m
  l: [1.00, 1.00, 512]   # YOLOv8l
  x: [1.00, 1.25, 512]   # YOLOv8x

# Backbone with RFCBAMConv and C2f_RFCBAM
# Output features at different scales: P3 (8x), P4 (16x), P5 (32x)
# Structure matches the architecture diagram:
# RFCBAMConv -> RFCBAMConv -> C2f_RFCBAM -> RFCBAMConv -> C2f_RFCBAM -> RFCBAMConv -> C2f_RFCBAM -> RFCBAMConv -> C2f_RFCBAM -> Mix-SPPF
backbone:
  # [from, repeats, module, args]
  # All initial layers use RFCBAMConv (not standard Conv)
  - [-1, 1, RFCBAMConv, [64]]  # 0-P1/2: First RFCBAMConv (k=3, s=2 default)
  - [-1, 1, RFCBAMConv, [128]]  # 1-P2/4: Second RFCBAMConv (k=3, s=2 default)
  - [-1, 3, C2f_RFCBAM, [128, True]]  # 2: First C2f_RFCBAM (output to Neck)
  - [-1, 1, RFCBAMConv, [256]]  # 3-P3/8: Third RFCBAMConv (k=3, s=2 default)
  - [-1, 6, C2f_RFCBAM, [256, True]]  # 4: Second C2f_RFCBAM (output to Neck)
  - [-1, 1, RFCBAMConv, [512]]  # 5-P4/16: Fourth RFCBAMConv (k=3, s=2 default)
  - [-1, 6, C2f_RFCBAM, [512, True]]  # 6: Third C2f_RFCBAM (output to Neck)
  - [-1, 1, RFCBAMConv, [1024]]  # 7-P5/32: Fifth RFCBAMConv (k=3, s=2 default)
  - [-1, 3, C2f_RFCBAM, [1024, True]]  # 8: Fourth C2f_RFCBAM (output to Neck)
  - [-1, 1, MixSPPF, [1024, 5]]  # 9: Mix-SPPF (output to Neck)

# Neck with RepGFPN and AKConv
# Feature Pyramid Network with reparameterized convolutions
# Structure: Right pathway (top-down) + Left pathway (bottom-up)
head:
  # Right Pathway - Top Segment (P5 from Mix-SPPF)
  - [9, 1, RepGFPN, [1024, 1]]  # 10: RepGFPN from Mix-SPPF
  - [-1, 1, AKConv, [1024, 5]]  # 11: AKConv
  # Output from top RepGFPN goes to Head (layer 10)
  
  # Left Pathway - Bottom Segment 1
  - [9, 1, nn.Upsample, [None, 2, 'nearest']]  # 12: UpSample from Mix-SPPF
  - [[-1, 6], 1, Concat, [1]]  # 13: Concat with backbone P4 (layer 6)
  - [-1, 1, C2f, [512]]  # 14: C2f block
  
  # Right Pathway - Middle Segment
  - [-1, 1, AKConv, [512, 5]]  # 15: AKConv from previous
  - [[-1, 14], 1, Concat, [1]]  # 16: Concat with C2f from left pathway
  - [-1, 1, RepGFPN, [512, 1]]  # 17: RepGFPN output (P4 scale)
  # Output from middle RepGFPN goes to Head (layer 17)
  
  # Left Pathway - Bottom Segment 2
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 18: UpSample
  - [[-1, 4], 1, Concat, [1]]  # 19: Concat with backbone P3 (layer 4)
  - [-1, 1, C2f, [256]]  # 20: C2f block
  
  # Right Pathway - Bottom Segment
  - [-1, 1, AKConv, [256, 5]]  # 21: AKConv from previous
  - [[-1, 20], 1, Concat, [1]]  # 22: Concat with C2f from left pathway
  - [-1, 1, RepGFPN, [256, 1]]  # 23: RepGFPN output (P3 scale)
  # Output from bottom RepGFPN goes to Head (layer 23)
  
  # Conv layers before Dynamic Head (as shown in diagram)
  - [10, 1, Conv, [1024, 1]]  # 24: Conv after top RepGFPN (P5)
  - [17, 1, Conv, [512, 1]]  # 25: Conv after middle RepGFPN (P4)
  - [23, 1, Conv, [256, 1]]  # 26: Conv after bottom RepGFPN (P3)
  
  # Dynamic Head for detection - receives 3 inputs from Conv layers
  # Order: [P3, P4, P5] from bottom to top (matching YOLO convention)
  - [[26, 25, 24], 1, Detect_DyHead, [nc, 256, 2]]  # args: nc, hidc, block_num

